In [1]:
import pandas as pd

In [2]:
my_dict = {
    "first_name": ["Ahan", "Jane", "John", "John"],
    "last_name": ["Jain", "Doe", "Doer", "Wick"],
    "age": [21, 22, 43, 56],
}

In [3]:
df = pd.DataFrame(my_dict)
df

  first_name last_name  age
0       Ahan      Jain   21
1       Jane       Doe   22
2       John      Doer   43
3       John      Wick   56

In [4]:
type(df)

pandas.core.frame.DataFrame

In [5]:
# df["first_name"] same as df.first_name - better to use index operator to avoid conflicts if a column has same name as an attribute
type(df["first_name"])

pandas.core.series.Series

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   first_name  4 non-null      object
 1   last_name   4 non-null      object
 2   age         4 non-null      int64
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [7]:
df.columns

Index(['first_name', 'last_name', 'age'], dtype='object')

In [8]:
# iloc allows row access using integers - returns a Series
df.iloc[0]

first_name    Ahan
last_name     Jain
age             21
Name: 0, dtype: object

In [9]:
df.iloc[[0, 2]]

  first_name last_name  age
0       Ahan      Jain   21
2       John      Doer   43

In [10]:
# can also specify column numbers to show
df.iloc[[0, 2], 0]

0    Ahan
2    John
Name: first_name, dtype: object

In [11]:
# we can use loc to use labels instead of column numbers
df.loc[[0, 2], "last_name"]

0    Jain
2    Doer
Name: last_name, dtype: object

In [12]:
df.loc[[0, 2], ["first_name", "last_name"]]

  first_name last_name
0       Ahan      Jain
2       John      Doer

In [13]:
# no need to wrap inside a list if slicing
# slicing is inclusive here - end is included for convenience
df.loc[0:2, "first_name":"last_name"]

  first_name last_name
0       Ahan      Jain
1       Jane       Doe
2       John      Doer

In [14]:
# be default, pandas creates an index (the 0, 1, 2 before the first_name column)
# we can manually set an index as well
# returns a new df if inplace=True is not explicitly defined
# can also be defined at the time csv is being read using index= argument
df_lname = df.set_index("last_name")
df_lname

          first_name  age
last_name
Jain            Ahan   21
Doe             Jane   22
Doer            John   43
Wick            John   56

In [15]:
# cannot use index to refer to column
# df_lname["last_name"]

df_lname[["first_name","age"]]

          first_name  age
last_name
Jain            Ahan   21
Doe             Jane   22
Doer            John   43
Wick            John   56

In [16]:
# allows us to use labels instead of integers while accessing values
df_lname.index

Index(['Jain', 'Doe', 'Doer', 'Wick'], dtype='object', name='last_name')

In [17]:
# one index at a time - every set_index with inplace=True overwrites previous index
df_lname.loc[["Jain", "Doe"]]

# won't work
# df_lname.loc[[0, 1]]

          first_name  age
last_name
Jain            Ahan   21
Doe             Jane   22

In [18]:
# can use iloc if we need integer indexing
df_lname.iloc[[0, 1]]

          first_name  age
last_name
Jain            Ahan   21
Doe             Jane   22

In [19]:
# can also set a combination of columns as index
# similar logic to composite primary key
df_comb = df.set_index(["first_name", "last_name"])
df_comb

                      age
first_name last_name
Ahan       Jain        21
Jane       Doe         22
John       Doer        43
           Wick        56

In [20]:
df_comb.index

MultiIndex([('Ahan', 'Jain'),
            ('Jane',  'Doe'),
            ('John', 'Doer'),
            ('John', 'Wick')],
           names=['first_name', 'last_name'])

In [21]:
# reset index
df_comb.reset_index(inplace=True)
df_comb.index

RangeIndex(start=0, stop=4, step=1)

In [22]:
# creating a non unique index
df_fname = df.set_index("first_name")
df_fname

           last_name  age
first_name
Ahan            Jain   21
Jane             Doe   22
John            Doer   43
John            Wick   56

In [23]:
# non-unique index returns a DataFrame
idx = df_fname.loc["John"]
# type(idx)
idx

           last_name  age
first_name
John            Doer   43
John            Wick   56

In [24]:
# unique index returns a Series
idx = df_lname.loc["Wick"]
# type(idx)
idx

first_name    John
age             56
Name: Wick, dtype: object

When index is unique, pandas use a hashtable to map key to value O(1). When index is non-unique and sorted, pandas use binary search O(logN), when index is random ordered pandas need to check all the keys in the index O(N)

In [25]:
filt = (df["first_name"] == "John") | (df["first_name"] == "Ahan")
type(filt) # pandas.core.series.Series
filt

0     True
1    False
2     True
3     True
Name: first_name, dtype: bool

In [26]:
df[filt]

  first_name last_name  age
0       Ahan      Jain   21
2       John      Doer   43
3       John      Wick   56

In [27]:
# can also use loc
df.loc[filt, "last_name"]

0    Jain
2    Doer
3    Wick
Name: last_name, dtype: object

In [28]:
data = [[0, 0, 'start', 0.712], [0, 0, 'end', 1.52], [0, 1, 'start', 3.14], [0, 1, 'end', 4.12], [1, 0, 'start', 0.55], [1, 0, 'end', 1.55], [1, 1, 'start', 0.43], [1, 1, 'end', 1.42], [2, 0, 'start', 4.1], [2, 0, 'end', 4.512], [2, 1, 'start', 2.5], [2, 1, 'end', 5]]
activity = pd.DataFrame(data, columns=['machine_id', 'process_id', 'activity_type', 'timestamp']).astype({'machine_id':'Int64', 'process_id':'Int64', 'activity_type':'object', 'timestamp':'Float64'})

In [29]:
activity

    machine_id  process_id activity_type  timestamp
0            0           0         start      0.712
1            0           0           end       1.52
2            0           1         start       3.14
3            0           1           end       4.12
4            1           0         start       0.55
5            1           0           end       1.55
6            1           1         start       0.43
7            1           1           end       1.42
8            2           0         start        4.1
9            2           0           end      4.512
10           2           1         start        2.5
11           2           1           end        5.0

In [59]:
pd.Index([*"packed"]).to_series()

p    p
a    a
c    c
k    k
e    e
d    d
dtype: object

In [49]:
activity.columns.to_series()

machine_id          machine_id
process_id          process_id
activity_type    activity_type
timestamp            timestamp
dtype: object

In [30]:
grouped_df = activity.groupby(["machine_id", "activity_type"])

for key, item in grouped_df:
    print(grouped_df.get_group(key), "\n\n")

   machine_id  process_id activity_type  timestamp
1           0           0           end       1.52
3           0           1           end       4.12


   machine_id  process_id activity_type  timestamp
0           0           0         start      0.712
2           0           1         start       3.14


   machine_id  process_id activity_type  timestamp
5           1           0           end       1.55
7           1           1           end       1.42


   machine_id  process_id activity_type  timestamp
4           1           0         start       0.55
6           1           1         start       0.43


    machine_id  process_id activity_type  timestamp
9            2           0           end      4.512
11           2           1           end        5.0


    machine_id  process_id activity_type  timestamp
8            2           0         start        4.1
10           2           1         start        2.5

In [31]:
grouped_df = activity.groupby(["machine_id", "activity_type"])
grouped_df = grouped_df["timestamp"].agg(("mean")).reset_index(name="average_times")
grouped_df

   machine_id activity_type  average_times
0           0           end           2.82
1           0         start          1.926
2           1           end          1.485
3           1         start           0.49
4           2           end          4.756
5           2         start            3.3

In [32]:
avg_start = grouped_df.loc[grouped_df["activity_type"] == 'start']
avg_end = grouped_df.loc[grouped_df["activity_type"] == 'end']
avg_start

   machine_id activity_type  average_times
1           0         start          1.926
3           1         start           0.49
5           2         start            3.3

In [33]:
merged_avg = pd.merge(avg_start, avg_end, on="machine_id")
# merged_avg
merged_avg["processing_time"] = merged_avg["average_times_y"] - merged_avg["average_times_x"]
merged_avg[["machine_id", "processing_time"]]

   machine_id  processing_time
0           0            0.894
1           1            0.995
2           2            1.456

In [34]:
activity

    machine_id  process_id activity_type  timestamp
0            0           0         start      0.712
1            0           0           end       1.52
2            0           1         start       3.14
3            0           1           end       4.12
4            1           0         start       0.55
5            1           0           end       1.55
6            1           1         start       0.43
7            1           1           end       1.42
8            2           0         start        4.1
9            2           0           end      4.512
10           2           1         start        2.5
11           2           1           end        5.0

In [35]:
# For each unique combination of index and columns, there must be exactly one corresponding value in the values column.
# if we pick machine_id as index, we will get an error because machine_id and activity_type column is not unique i.e. some combination  of machine_id and an activity_type value is not unique
# all machine_ids have multiple processes and therefore there will be as many common machine_id | activity_type combos as the number of processes * 2
# Ex: machine_id = 2 has activity_type = start for process_id = (0, 1) - not unique
# Ex: machine_id = 2 has activity_type = end for process_id = (0, 1) - not unique
# Picking machine_id and process_id as index solves this problem as there is a single start and end for every machine_id, process_id combination
pivoted_activity = activity.pivot(
    index=["machine_id", "process_id"], columns="activity_type", values="timestamp"
)
pivoted_activity

activity_type            end  start
machine_id process_id
0          0            1.52  0.712
           1            4.12   3.14
1          0            1.55   0.55
           1            1.42   0.43
2          0           4.512    4.1
           1             5.0    2.5

In [36]:
pivoted_activity["processing_time"] = (
    pivoted_activity["end"] - pivoted_activity["start"]
)
pivoted_activity.groupby("machine_id").agg(
    processing_time=("processing_time", "mean")
).round(3).reset_index()

   machine_id  processing_time
0           0            0.894
1           1            0.995
2           2            1.456

In [37]:
# use pivot_table() if there is no guarantee of uniqueness between index and column combination
# how it deals with duplicate rows - it aggregates them using an aggregation function (default: mean)
# here combination of machine_id and activity_type is not unique
# Ex: machine_id = 2 has activity_type = start for process_id = (0, 1) - not unique
# pivot_table() aggregates the duplicate values
# what happens here -

# machine_id	process_id	activity_type	timestamp
#   2	            0	        start	        4.1
#   2	            0	        end	            4.512
#   2	            1	        start	        2.5
#   2 	            1	        end	            5.0

# it aggregates machine_id and activity_type i.e. it aggregates all activity_type times for a particular machine_id and activity_type
# all start and end times are aggregated (in separate columns) for each machine_id

activity_pivot_table = activity.pivot_table(
    index=["machine_id"], columns="activity_type", values="timestamp"
).reset_index()
activity_pivot_table

activity_type  machine_id    end  start
0                       0   2.82  1.926
1                       1  1.485   0.49
2                       2  4.756    3.3

In [38]:
activity_pivot_table["processing_time"] = (activity_pivot_table["end"] - activity_pivot_table["start"]).round(3)
activity_pivot_table[["machine_id", "processing_time"]]

activity_type  machine_id  processing_time
0                       0            0.894
1                       1            0.995
2                       2            1.456

In [39]:
data = [[1, 'Alice'], [2, 'Bob'], [13, 'John'], [6, 'Alex']]
students = pd.DataFrame(data, columns=['student_id', 'student_name']).astype({'student_id':'Int64', 'student_name':'object'})
data = [['Math'], ['Physics'], ['Programming']]
subjects = pd.DataFrame(data, columns=['subject_name']).astype({'subject_name':'object'})
data = [[1, 'Math'], [1, 'Physics'], [1, 'Programming'], [2, 'Programming'], [1, 'Physics'], [1, 'Math'], [13, 'Math'], [13, 'Programming'], [13, 'Physics'], [2, 'Math'], [1, 'Math']]
examinations = pd.DataFrame(data, columns=['student_id', 'subject_name']).astype({'student_id':'Int64', 'subject_name':'object'})

In [40]:
students

   student_id student_name
0           1        Alice
1           2          Bob
2          13         John
3           6         Alex

In [41]:
subjects

  subject_name
0         Math
1      Physics
2  Programming

In [42]:
examinations

    student_id subject_name
0            1         Math
1            1      Physics
2            1  Programming
3            2  Programming
4            1      Physics
5            1         Math
6           13         Math
7           13  Programming
8           13      Physics
9            2         Math
10           1         Math

In [43]:
student_subjects_df = pd.merge(students, subjects, how="cross")
student_subjects_df

    student_id student_name subject_name
0            1        Alice         Math
1            1        Alice      Physics
2            1        Alice  Programming
3            2          Bob         Math
4            2          Bob      Physics
5            2          Bob  Programming
6           13         John         Math
7           13         John      Physics
8           13         John  Programming
9            6         Alex         Math
10           6         Alex      Physics
11           6         Alex  Programming

In [44]:
examinations['exam_attended'] = 1
student_subjects_exams_df = pd.merge(student_subjects_df, examinations, on=["student_id", "subject_name"], how="left")
student_subjects_exams_df

    student_id student_name subject_name  exam_attended
0            1        Alice         Math            1.0
1            1        Alice         Math            1.0
2            1        Alice         Math            1.0
3            1        Alice      Physics            1.0
4            1        Alice      Physics            1.0
5            1        Alice  Programming            1.0
6            2          Bob         Math            1.0
7            2          Bob      Physics            NaN
8            2          Bob  Programming            1.0
9           13         John         Math            1.0
10          13         John      Physics            1.0
11          13         John  Programming            1.0
12           6         Alex         Math            NaN
13           6         Alex      Physics            NaN
14           6         Alex  Programming            NaN

In [45]:
student_subjects_exams_group = student_subjects_exams_df.groupby(["student_id", "subject_name"]).agg(attended_exams=('exam_attended', 'count')).reset_index()
student_subjects_exams_group.sort_values(by=["student_id", "subject_name"])

    student_id subject_name  attended_exams
0            1         Math               3
1            1      Physics               2
2            1  Programming               1
3            2         Math               1
4            2      Physics               0
5            2  Programming               1
6            6         Math               0
7            6      Physics               0
8            6  Programming               0
9           13         Math               1
10          13      Physics               1
11          13  Programming               1